#include <iostream>
#include <iomanip>
using namespace std;

int main() {
    cout << fixed << setprecision(4); // Фіксований формат з 4 знаками після крапки
    
    // =========================
    // Задача Begin25 (варіант 25)
    // Відомо, що X кг шоколадних цукерок коштує A грн, а Y кг печива — B грн.
    // Знайти ціну 1 кг шоколадних цукерок, 1 кг печива та
    // у скільки разів шоколадні цукерки дорожчі за печиво.
    // Джерело постановки задачі: Табл.1, методичка (ЛР1).
    // =========================
    cout << "=== Задача Begin25 ===\n";
    double X, A, Y, B;
    cout << "Введiть X (кг шоколадних цукерок): ";
    cin  >> X;
    cout << "Введiть A (грн за X кг): ";
    cin  >> A;
    cout << "Введiть Y (кг печива): ";
    cin  >> Y;
    cout << "Введiть B (грн за Y кг): ";
    cin  >> B;
    
    // Обчислення (припускаємо коректні невід’ємні/ненульові вхідні дані згідно з методичкою)
    double priceChocoPerKg = A / X;   // грн/кг
    double priceCookiePerKg = B / Y;  // грн/кг
    double ratio = priceChocoPerKg / priceCookiePerKg;
    
    cout << "Цiна 1 кг шоколадних цукерок: " << priceChocoPerKg << " грн/кг\n";
    cout << "Цiна 1 кг печива: " << priceCookiePerKg << " грн/кг\n";
    cout << "Шоколаднi цукерки дорожчi у " << ratio << " раз(и)\n\n";
    
    // =========================
    // Задача Begin7 (варіант 7)
    // Знайти довжину кола L = 2 * pi * R та площу круга S = pi * R^2
    // для заданого радіуса R. Використовувати pi = 3.14 (за методичкою).
    // =========================
    cout << "=== Задача Begin7 ===\n";
    const double PI = 3.14; // строго за вимогами завдання
    double R;
    cout << "Введiть R (радiус): ";
    cin  >> R;
    
    double L = 2.0 * PI * R;
    double S = PI * R * R;
    
    cout << "Довжина кола L: " << L << "\n";
    cout << "Площа круга S: " << S << "\n\n";
    
    // =========================
    // Задача Begin45 (варіант 45)
    // Дано шлях S та час t. Знайти швидкість V = S / t.
    // =========================
    cout << "=== Задача Begin45 ===\n";
    double Sdist, t;
    cout << "Введiть S (шлях): ";
    cin  >> Sdist;
    cout << "Введiть t (час): ";
    cin  >> t;
    
    double V = Sdist / t;
    cout << "Швидкiсть V: " << V << " (одиниць/од.часу)\n";
    
    // Кiнець програми
    return 0;
}
